In [48]:
str1 =  "applehellodkk"

In [49]:
str_list = list(str1)
str_list

['a', 'p', 'p', 'l', 'e', 'h', 'e', 'l', 'l', 'o', 'd', 'k', 'k']

In [52]:
try:
    for i in range(len(str_list)):
        if str_list[i] == str_list[i+1]:
            print(str_list[i])
except:
    pass

p
l
k

In [18]:
# Day 1: 75°F              (Not enough data for a moving average)
# Day 2: 78°F              (Not enough data for a moving average)
# Day 3: 80°F    => Moving Average: 77.67°F
# Day 4: 82°F    => Moving Average: 80.00°F
# Day 5: 77°F    => Moving Average: 79.67°F
# Day 6: 75°F    => Moving Average: 78.00°F
# Day 7: 74°F    => Moving Average: 75.33°F

In [2]:
import pandas as pd

In [31]:
data = {
    'date': [1,2,3,4,5,6,7],
    'temp': [75,78,80,82,77,75,74]
}

In [32]:
data

{'date': [1, 2, 3, 4, 5, 6, 7], 'temp': [75, 78, 80, 82, 77, 75, 74]}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

   date  temp
0     1    75
1     2    78
2     3    80
3     4    82
4     5    77
5     6    75
6     7    74

In [35]:
moving_avrage = df['temp'].rolling(window = 3).mean()

In [36]:
moving_avrage

0          NaN
1          NaN
2    77.666667
3    80.000000
4    79.666667
5    78.000000
6    75.333333
Name: temp, dtype: float64

In [43]:
for i in range (len(df["temp"])):
    if i < 2:
        print("NaN")
    
    if i > 4:
        for j in range(i):
            moving_avg = print((df["temp"][j]+df["temp"][j+1]+df["temp"][j+2])/3)
        print((moving_avg))
        break

NaN
NaN
77.66666666666667
80.0
79.66666666666667
78.0
75.33333333333333
None

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
# import seaborn as sns

# Create a DataFrame
data = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'Age': [20, 45, 30, 25, 35],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Female'],
    'Income': [30000, 60000, 50000, 70000, 80000],
    'SpendingScore': [50, 75, 45, 85, 70]
})

# Display the first few rows
print(data.head())

   CustomerID  Age  Gender  Income  SpendingScore
0           1   20    Male   30000             50
1           2   45  Female   60000             75
2           3   30    Male   50000             45
3           4   25  Female   70000             85
4           5   35  Female   80000             70

In [2]:
# Calculate the mean income and spending score for each age group 
# (bins of 10 years) and
# find the age group with the highest income.

In [24]:
age_bins = [20, 30, 40, 50]

In [25]:
# try:
age_group_list = []
for age in data.Age:
    for i in range(len(age_bins)):
        if age_bins[i] <= age <  age_bins[i+1]:
            age_group_list.append((age_bins[i],age_bins[i+1]))
# except:
#     pass

In [26]:
age_group_list

[(20, 30), (40, 50), (30, 40), (20, 30), (30, 40)]

In [27]:
data['AgeGroup'] = age_group_list
data

   CustomerID  Age  Gender  Income  SpendingScore  AgeGroup
0           1   20    Male   30000             50  (20, 30)
1           2   45  Female   60000             75  (40, 50)
2           3   30    Male   50000             45  (30, 40)
3           4   25  Female   70000             85  (20, 30)
4           5   35  Female   80000             70  (30, 40)

In [28]:
grouped = data.groupby('AgeGroup').agg({'Income': 'mean', 'SpendingScore': 'mean'})

In [29]:
grouped

           Income  SpendingScore
AgeGroup
(20, 30)  50000.0           67.5
(30, 40)  65000.0           57.5
(40, 50)  60000.0           75.0